# 직접 해보세요!
## 시리즈와 데이터프레임 직접 만들기(51쪽)
### 1. 시리즈 만들기

In [1]:
import pandas as pd
s = pd.Series(['banana', 42])
print(s)

0    banana
1        42
dtype: object

In [2]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'])
print(s)

0         Wes McKinney
1    Creator of Pandas
dtype: object

In [2]:
s = pd.Series(['Wes McKinney', 'Creator of Pandas'], index=['Person', 'Who'])
print(s)

Person         Wes McKinney
Who       Creator of Pandas
dtype: object

### 3. 데이터프레임 만들기

In [3]:
scientists = pd.DataFrame({ 
    'Name': ['Rosaline Franklin', 'William Gosset'], 
    'Occupation': ['Chemist', 'Statistician'], 
    'Born': ['1920-07-25', '1876-06-13'], 
    'Died': ['1958-04-16', '1937-10-16'], 
    'Age': [37, 61]}) 
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

In [5]:
scientists = pd.DataFrame( 
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Age', 'Died']) 
print(scientists)

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [7]:
scientists2 = pd.DataFrame( 
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Age', 'Died']) 
print(scientists)

                     Occupation        Born  Age        Died
Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
William Gosset     Statistician  1876-06-13   61  1937-10-16

In [10]:

#컬럼 이름 바꾸기 
scientists2.reset_index().rename({'index':'Name'},axis=1)
scientists2.reset_index().rename({'Born':'Born_date'},axis=1)

               index    Occupation   Born_date  Age        Died
0  Rosaline Franklin       Chemist  1920-07-25   37  1958-04-16
1     William Gosset  Statistician  1876-06-13   61  1937-10-16

In [4]:
#원래 딕셔너리에는 순서가 없다. 열을 네임, 오케이션.. 이렇게 만들었다고 그 순서대로 나오는 것은 우연이다. 내가 쓴대로 순서있게 만드려면 OrderedDict 를 만든다. 

from collections import OrderedDict

scientists = pd.DataFrame(OrderedDict([ 
    ('Name', ['Rosaline Franklin', 'William Gosset']),
    ('Occupation', ['Chemist', 'Statistician']), 
    ('Born', ['1920-07-25', '1876-06-13']), 
    ('Died', ['1958-04-16', '1937-10-16']), 
    ('Age', [37, 61])
])
) 
print(scientists)

                Name    Occupation        Born        Died  Age
0  Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
1     William Gosset  Statistician  1876-06-13  1937-10-16   61

# 직접 해보세요!
## 데이터프레임에서 시리즈 선택하기(54쪽)

In [12]:
scientists = pd.DataFrame(
    data={'Occupation': ['Chemist', 'Statistician'], 
          'Born': ['1920-07-25', '1876-06-13'], 
          'Died': ['1958-04-16', '1937-10-16'],
          'Age': [37, 61]},
    index=['Rosaline Franklin', 'William Gosset'],
    columns=['Occupation', 'Born', 'Died', 'Age'])

In [16]:
scientists

                     Occupation        Born        Died  Age
Rosaline Franklin       Chemist  1920-07-25  1958-04-16   37
William Gosset     Statistician  1876-06-13  1937-10-16   61

In [13]:
first_row = scientists.loc['William Gosset'] 
print(type(first_row))

<class 'pandas.core.series.Series'>

In [14]:
print(first_row)

Occupation    Statistician
Born            1876-06-13
Died            1937-10-16
Age                     61
Name: William Gosset, dtype: object

# 직접 해보세요!
## index, values 속성과 keys 메서드 사용하기(55쪽)

### 1. index 속성 사용하기

In [15]:
print(first_row.index)

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### 2. values 속성 사용하기

In [17]:
print(first_row.values)

['Statistician' '1876-06-13' '1937-10-16' 61]

### 3. keys 메서드 사용하기

In [18]:
print(first_row.keys())

Index(['Occupation', 'Born', 'Died', 'Age'], dtype='object')

### 4. index 속성 응용하기

In [19]:
print(first_row.index[0])

Occupation

In [21]:
print(first_row.index[0:1])

Index(['Occupation'], dtype='object')

### 5. keys 메서드와 index 속성 응용하기

In [14]:
print(first_row.keys()[0])

Occupation

In [22]:
first_row[['Occupation', 'Age']]  #뺀시 색인

Occupation    Statistician
Age                     61
Name: William Gosset, dtype: object

# 직접 해보세요!
## 시리즈의 mean, min, max, std 메서드 사용하기(56쪽)

In [23]:
ages = scientists['Age'] 
print(ages)

Rosaline Franklin    37
William Gosset       61
Name: Age, dtype: int64

In [24]:
print(ages.mean())

49.0

In [25]:
print(ages.min())

37

In [26]:
print(ages.max())

61

In [27]:
print(ages.std())

16.97056274847714

# 직접 해보세요!
## 시리즈와 불린 추출 사용하기(59쪽)

In [28]:
scientists = pd.read_csv('../data/scientists.csv')

In [29]:
ages = scientists['Age'] 

print(ages.max())

90

In [30]:
print(ages.mean())

59.125

In [31]:
print(ages[ages > ages.mean()])

1    61
2    90
3    66
7    77
Name: Age, dtype: int64

In [32]:
print(ages > ages.mean())

0    False
1     True
2     True
3     True
4    False
5    False
6    False
7     True
Name: Age, dtype: bool

In [38]:
ages[ages > ages.mean()].reset_index(drop=True) #기존 인덱스 버리고 새로운 인덱스 생성.

0    61
1    90
2    66
3    77
Name: Age, dtype: int64

In [35]:
print(type(ages > ages.mean()))

<class 'pandas.core.series.Series'>

In [39]:
manual_bool_values = [True, True, False, False, True, True, False, True] 
print(ages[manual_bool_values])

0    37
1    61
4    56
5    45
7    77
Name: Age, dtype: int64

bollean container와 Series의 size가 다르면(위의 예에서는 ages), 갖도록 맞추어준 후 , 색인한다

In [47]:
ages[:4].add(ages[-4:],fill_value=0) # 만약에 원본에 결측값이 있었다면 0으로 채워짐.

0    37.0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: Age, dtype: float64

In [43]:
ages[:4].multiply(ages[-4:],fill_value=1) # 그러므로 항등원으로 연산해줘야함. 곱셈의 항등원은 1이다.

0    37.0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: Age, dtype: float64

결측값 대체를 위해 add 외에도 subtract, multiply, devide 등이 존재한다.

# 직접 해보세요!
## 벡터와 스칼라로 브로드캐스팅 수행하기(61쪽)

In [12]:
print(ages + ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [13]:
print(ages * ages)

0    1369
1    3721
2    8100
3    4356
4    3136
5    2025
6    1681
7    5929
Name: Age, dtype: int64

In [14]:
print(ages + 100)

0    137
1    161
2    190
3    166
4    156
5    145
6    141
7    177
Name: Age, dtype: int64

In [15]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [16]:
print(pd.Series([1, 100]))

0      1
1    100
dtype: int64

In [17]:
print(ages + pd.Series([1, 100]))

0     38.0
1    161.0
2      NaN
3      NaN
4      NaN
5      NaN
6      NaN
7      NaN
dtype: float64

In [18]:
rev_ages = ages.sort_index(ascending=False) 
print(rev_ages)

7    77
6    41
5    45
4    56
3    66
2    90
1    61
0    37
Name: Age, dtype: int64

In [19]:
print(ages * 2)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [20]:
print(ages + rev_ages)

0     74
1    122
2    180
3    132
4    112
5     90
6     82
7    154
Name: Age, dtype: int64

In [50]:
scientists.sort_values('Age')

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse

In [57]:
scientists.sort_values('Age').sort_index# 원래대로 돌아오게 하려면 ??????????

<bound method DataFrame.sort_index of                    Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
5             John Snow  1813-03-15  1858-06-16   45           Physician
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse>

In [60]:
scientists*2 # 각프레임워크에 칸칸에 두번 쓰여짐. 단, age는 곱하기 두배가 되어버림.

,Name,Born,Died,Age,Occupation
0,Rosaline FranklinRosaline Franklin,1920-07-251920-07-25,1958-04-161958-04-16,74,ChemistChemist
1,William GossetWilliam Gosset,1876-06-131876-06-13,1937-10-161937-10-16,122,StatisticianStatistician
2,Florence NightingaleFlorence Nightingale,1820-05-121820-05-12,1910-08-131910-08-13,180,NurseNurse
3,Marie CurieMarie Curie,1867-11-071867-11-07,1934-07-041934-07-04,132,ChemistChemist
4,Rachel CarsonRachel Carson,1907-05-271907-05-27,1964-04-141964-04-14,112,BiologistBiologist
5,John SnowJohn Snow,1813-03-151813-03-15,1858-06-161858-06-16,90,PhysicianPhysician
6,Alan TuringAlan Turing,1912-06-231912-06-23,1954-06-071954-06-07,82,Computer ScientistComputer Scientist
7,Johann GaussJohann Gauss,1777-04-301777-04-30,1855-02-231855-02-23,154,MathematicianMathematician

In [66]:

pd.concat([scientists,scientists],axis=0)

                   Name        Born        Died  Age          Occupation
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

In [65]:
pd.concat([scientists,scientists],axis=1)

,Name,Born,Died,Age,Occupation,Name,Born,Died,Age,Occupation
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,Marie Curie,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician,John Snow,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [69]:
pd.merge(scientists,scientists,left_index=True, right_index=True)

,Name_x,Born_x,Died_x,Age_x,Occupation_x,Name_y,Born_y,Died_y,Age_y,Occupation_y
0,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist,Rosaline Franklin,1920-07-25,1958-04-16,37,Chemist
1,William Gosset,1876-06-13,1937-10-16,61,Statistician,William Gosset,1876-06-13,1937-10-16,61,Statistician
2,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse,Florence Nightingale,1820-05-12,1910-08-13,90,Nurse
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,Marie Curie,1867-11-07,1934-07-04,66,Chemist
4,Rachel Carson,1907-05-27,1964-04-14,56,Biologist,Rachel Carson,1907-05-27,1964-04-14,56,Biologist
5,John Snow,1813-03-15,1858-06-16,45,Physician,John Snow,1813-03-15,1858-06-16,45,Physician
6,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist,Alan Turing,1912-06-23,1954-06-07,41,Computer Scientist
7,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician,Johann Gauss,1777-04-30,1855-02-23,77,Mathematician

In [75]:
pd.merge(scientists.T,scientists.T, left_index=True, right_index=True).T

                     Name        Born        Died Age          Occupation
0_x     Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist
1_x        William Gosset  1876-06-13  1937-10-16  61        Statistician
2_x  Florence Nightingale  1820-05-12  1910-08-13  90               Nurse
3_x           Marie Curie  1867-11-07  1934-07-04  66             Chemist
4_x         Rachel Carson  1907-05-27  1964-04-14  56           Biologist
5_x             John Snow  1813-03-15  1858-06-16  45           Physician
6_x           Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist
7_x          Johann Gauss  1777-04-30  1855-02-23  77       Mathematician
0_y     Rosaline Franklin  1920-07-25  1958-04-16  37             Chemist
1_y        William Gosset  1876-06-13  1937-10-16  61        Statistician
2_y  Florence Nightingale  1820-05-12  1910-08-13  90               Nurse
3_y           Marie Curie  1867-11-07  1934-07-04  66             Chemist
4_y         Rachel Carson  1907-05-27  1964-04-14  56           Biologist
5_y             John Snow  1813-03-15  1858-06-16  45           Physician
6_y           Alan Turing  1912-06-23  1954-06-07  41  Computer Scientist
7_y          Johann Gauss  1777-04-30  1855-02-23  77       Mathematician

# 직접 해보세요!
## 불린 추출과 브로드캐스팅(65쪽)

In [54]:
print(scientists[scientists['Age'] > scientists['Age'].mean()])

                   Name        Born        Died  Age     Occupation
1        William Gosset  1876-06-13  1937-10-16   61   Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90          Nurse
3           Marie Curie  1867-11-07  1934-07-04   66        Chemist
7          Johann Gauss  1777-04-30  1855-02-23   77  Mathematician

In [55]:
print(scientists.loc[[True, True, False, True]])

IndexError: Boolean index has wrong length: 4 instead of 8

In [38]:
print(scientists * 2)

                                       Name                  Born  \
0        Rosaline FranklinRosaline Franklin  1920-07-251920-07-25
1              William GossetWilliam Gosset  1876-06-131876-06-13
2  Florence NightingaleFlorence Nightingale  1820-05-121820-05-12
3                    Marie CurieMarie Curie  1867-11-071867-11-07
4                Rachel CarsonRachel Carson  1907-05-271907-05-27
5                        John SnowJohn Snow  1813-03-151813-03-15
6                    Alan TuringAlan Turing  1912-06-231912-06-23
7                  Johann GaussJohann Gauss  1777-04-301777-04-30

                   Died  Age                            Occupation
0  1958-04-161958-04-16   74                        ChemistChemist
1  1937-10-161937-10-16  122              StatisticianStatistician
2  1910-08-131910-08-13  180                            NurseNurse
3  1934-07-041934-07-04  132                        ChemistChemist
4  1964-04-141964-04-14  112                    BiologistBiologist
5  1858-06-161858-06-16   90                    PhysicianPhysician
6  1954-06-071954-06-07   82  Computer ScientistComputer Scientist
7  1855-02-231855-02-23  154            MathematicianMathematician

# 직접 해보세요!
## 시리즈와 데이터프레임의 데이터 처리하기(67쪽)

In [113]:
print(scientists['Born'].dtype)
print(scientists['Died'].dtype)

object
object

In [114]:
born_datetime = pd.to_datetime(scientists['Born'], format='%Y-%m-%d') 
print(born_datetime)

0   1920-07-25
1   1876-06-13
2   1820-05-12
3   1867-11-07
4   1907-05-27
5   1813-03-15
6   1912-06-23
7   1777-04-30
Name: Born, dtype: datetime64[ns]

In [115]:
died_datetime = pd.to_datetime(scientists['Died'], format='%Y-%m-%d')
print(died_datetime)

0   1958-04-16
1   1937-10-16
2   1910-08-13
3   1934-07-04
4   1964-04-14
5   1858-06-16
6   1954-06-07
7   1855-02-23
Name: Died, dtype: datetime64[ns]

In [116]:
scientists['born_dt'], scientists['died_dt'] = (born_datetime, died_datetime)
print(scientists.head())

                   Name        Born        Died  Age    Occupation    born_dt  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37       Chemist 1920-07-25
1        William Gosset  1876-06-13  1937-10-16   61  Statistician 1876-06-13
2  Florence Nightingale  1820-05-12  1910-08-13   90         Nurse 1820-05-12
3           Marie Curie  1867-11-07  1934-07-04   66       Chemist 1867-11-07
4         Rachel Carson  1907-05-27  1964-04-14   56     Biologist 1907-05-27

     died_dt age_days_dt            age_years_dt
0 1958-04-16  13779 days 37 days 18:00:59.178082
1 1937-10-16  22404 days 61 days 09:08:23.013698
2 1910-08-13  32964 days 90 days 07:29:45.205479
3 1934-07-04  24345 days 66 days 16:46:01.643835
4 1964-04-14  20777 days 56 days 22:09:32.054794

In [117]:
print(scientists.shape) #변수가 2개 늘어남.

(8, 9)

In [119]:
from datetime import datetime
datetime(1958, 4, 16) - datetime(1920, 7, 25)

datetime.timedelta(days=13779)

In [120]:
scientists['age_days_dt'] = (scientists['died_dt'] - \
                             scientists['born_dt'])
print(scientists) #사는날동안의 계산한 것 열 추가.

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt            age_years_dt
0 1920-07-25 1958-04-16  13779 days 37 days 18:00:59.178082
1 1876-06-13 1937-10-16  22404 days 61 days 09:08:23.013698
2 1820-05-12 1910-08-13  32964 days 90 days 07:29:45.205479
3 1867-11-07 1934-07-04  24345 days 66 days 16:46:01.643835
4 1907-05-27 1964-04-14  20777 days 56 days 22:09:32.054794
5 1813-03-15 1858-06-16  16529 days 45 days 06:50:18.082191
6 1912-06-23 1954-06-07  15324 days 41 days 23:36:19.726027
7 1777-04-30 1855-02-23  28422 days 77 days 20:50:37.808219

In [126]:
scientists['age_years_dt'] = (scientists['age_days_dt']  \
                             /365.25  ).dt.days
print(scientists)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt  age_years_dt
0 1920-07-25 1958-04-16  13779 days            37
1 1876-06-13 1937-10-16  22404 days            61
2 1820-05-12 1910-08-13  32964 days            90
3 1867-11-07 1934-07-04  24345 days            66
4 1907-05-27 1964-04-14  20777 days            56
5 1813-03-15 1858-06-16  16529 days            45
6 1912-06-23 1954-06-07  15324 days            41
7 1777-04-30 1855-02-23  28422 days            77

In [134]:
import numpy as np

scientists['age_days_dt'].astype(np.timedelta64(1,'Y'))

scientists['age_days_dt'].astype('timedelta64[Y]')

0    37.0
1    61.0
2    90.0
3    66.0
4    56.0
5    45.0
6    41.0
7    77.0
Name: age_days_dt, dtype: float64

In [123]:
scientists['age_years_dt'] = (scientists['died_dt'].dt.year - \
                             scientists['born_dt'].dt.year)
print(scientists)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   37             Chemist
1        William Gosset  1876-06-13  1937-10-16   61        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   90               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   56           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   41  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   77       Mathematician

     born_dt    died_dt age_days_dt  age_years_dt
0 1920-07-25 1958-04-16  13779 days            38
1 1876-06-13 1937-10-16  22404 days            61
2 1820-05-12 1910-08-13  32964 days            90
3 1867-11-07 1934-07-04  24345 days            67
4 1907-05-27 1964-04-14  20777 days            57
5 1813-03-15 1858-06-16  16529 days            45
6 1912-06-23 1954-06-07  15324 days            42
7 1777-04-30 1855-02-23  28422 days            78

### 5. 시리즈, 데이터프레임의 데이터 섞기

In [135]:
print(scientists['Age'])

0    37
1    61
2    90
3    66
4    56
5    45
6    41
7    77
Name: Age, dtype: int64

In [136]:
import random

random.seed(42)
random.shuffle(scientists['Age'])
print(scientists['Age'])

0    66
1    56
2    41
3    77
4    90
5    45
6    37
7    61
Name: Age, dtype: int64

C:\Users\student\Anaconda3\lib\random.py:278: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  x[i], x[j] = x[j], x[i]

In [138]:
import random
random.seed(42)
random.shuffle(scientists['Age'][:5])
print(scientists['Age'])

0    90
1    56
2    41
3    66
4    77
5    45
6    37
7    61
Name: Age, dtype: int64

In [147]:
# scientist 자체를 섞기

idx = np.arange(len(scientists))
np.random.shuffle(idx)

In [146]:
scientists.iloc[idx]

,Name,Born,Died,Age,Occupation,born_dt,died_dt,age_days_dt,age_years_dt
3,Marie Curie,1867-11-07,1934-07-04,66,Chemist,1867-11-07,1934-07-04,24345 days,66
0,Rosaline Franklin,1920-07-25,1958-04-16,90,Chemist,1920-07-25,1958-04-16,13779 days,37
7,Johann Gauss,1777-04-30,1855-02-23,61,Mathematician,1777-04-30,1855-02-23,28422 days,77
5,John Snow,1813-03-15,1858-06-16,45,Physician,1813-03-15,1858-06-16,16529 days,45
1,William Gosset,1876-06-13,1937-10-16,56,Statistician,1876-06-13,1937-10-16,22404 days,61
6,Alan Turing,1912-06-23,1954-06-07,37,Computer Scientist,1912-06-23,1954-06-07,15324 days,41
4,Rachel Carson,1907-05-27,1964-04-14,77,Biologist,1907-05-27,1964-04-14,20777 days,56
2,Florence Nightingale,1820-05-12,1910-08-13,41,Nurse,1820-05-12,1910-08-13,32964 days,90

머신러닝 학습데이터 

한 에폭이 끝난 후 셔플을 시켜줘서 새로운 에폭을 실시한다

### 7. 데이터프레임의 열 삭제하기

In [148]:
print(scientists.columns)

Index(['Name', 'Born', 'Died', 'Age', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt', 'age_years_dt'],
      dtype='object')

In [160]:
scientists_dropped = scientists.drop(['Age'], axis=1)

print(scientists_dropped.columns)

Index(['Name', 'Born', 'Died', 'Occupation', 'born_dt', 'died_dt',
       'age_days_dt', 'age_years_dt'],
      dtype='object')

In [162]:
scientists_dropped.drop(['Born'], axis =1, inplace=True) #자체적으로 그 자리에서 얘 자체가 바꾼다. 
scientists_dropped.head()

,Name,Died,Occupation,born_dt,died_dt,age_days_dt,age_years_dt
0,Rosaline Franklin,1958-04-16,Chemist,1920-07-25,1958-04-16,13779 days,37
1,William Gosset,1937-10-16,Statistician,1876-06-13,1937-10-16,22404 days,61
2,Florence Nightingale,1910-08-13,Nurse,1820-05-12,1910-08-13,32964 days,90
3,Marie Curie,1934-07-04,Chemist,1867-11-07,1934-07-04,24345 days,66
4,Rachel Carson,1964-04-14,Biologist,1907-05-27,1964-04-14,20777 days,56

# 직접 해보세요!
## 데이터를 피클, CSV, TSV 파일로 저장하고 불러오기(72쪽)

### 1. 피클로 저장하기

pickle 모듈
일반 텍스트를 파일로 저장할 때는 파일 입출력을 이용한다.
하지만 리스트나 클래스같은 텍스트가 아닌 자료형은 일반적인 파일 입출력 방법으로는 데이터를 저장하거나 불러올 수 없다.
파이썬에서는 이와 같은 텍스트 이외의 자료형을 파일로 저장하기 위하여 pickle이라는 모듈을 제공한다.

In [168]:
names = scientists['Name']

In [169]:
names.to_pickle('../output/scientists_names_series.pickle')

In [170]:
scientists.to_pickle('../output/scientists_df.pickle')

In [171]:
scientist_names_from_pickle = pd.read_pickle('../output/scientists_names_series.pickle')
print(scientist_names_from_pickle)

0       Rosaline Franklin
1          William Gosset
2    Florence Nightingale
3             Marie Curie
4           Rachel Carson
5               John Snow
6             Alan Turing
7            Johann Gauss
Name: Name, dtype: object

In [172]:
scientists_from_pickle = pd.read_pickle('../output/scientists_df.pickle')
print(scientists_from_pickle)

                   Name        Born        Died  Age          Occupation  \
0     Rosaline Franklin  1920-07-25  1958-04-16   90             Chemist
1        William Gosset  1876-06-13  1937-10-16   56        Statistician
2  Florence Nightingale  1820-05-12  1910-08-13   41               Nurse
3           Marie Curie  1867-11-07  1934-07-04   66             Chemist
4         Rachel Carson  1907-05-27  1964-04-14   77           Biologist
5             John Snow  1813-03-15  1858-06-16   45           Physician
6           Alan Turing  1912-06-23  1954-06-07   37  Computer Scientist
7          Johann Gauss  1777-04-30  1855-02-23   61       Mathematician

     born_dt    died_dt age_days_dt  age_years_dt
0 1920-07-25 1958-04-16  13779 days            37
1 1876-06-13 1937-10-16  22404 days            61
2 1820-05-12 1910-08-13  32964 days            90
3 1867-11-07 1934-07-04  24345 days            66
4 1907-05-27 1964-04-14  20777 days            56
5 1813-03-15 1858-06-16  16529 days            45
6 1912-06-23 1954-06-07  15324 days            41
7 1777-04-30 1855-02-23  28422 days            77

### 4. CSV 파일과 TSV 파일로 저장하기

In [173]:
names.to_csv('../output/scientist_names_series.csv')

In [174]:
scientists.to_csv('../output/scientists_df.tsv', sep='\t')

In [175]:
scientists.to_csv('../output/scientists_df_no_index.csv', index=False)

In [178]:
names_df = names.to_frame()

import xlwt 
names_df.to_excel('../output/scientists_names_series_df.xls')

import openpyxl 
names_df.to_excel('../output/scientists_names_series_df.xlsx')